# Pandas is an important Python library for data manipulation,  
# and analysis. It functions as an intuitive and easy-to-use set of tools 
# for performing operations on any kind of data.

Data Structures of Pandas
-------------------------
All the data representation in pandas is done using two primary data structures:
• Series
• Dataframes

Series
Series in pandas is a one-dimensional ndarray with an axis label. It means that in functionality, it is almost similar to a simple array.

Dataframe
1> Dataframe is the most important and useful data structure, which is used for almost all kind of data representation and manipulation in pandas. Unlike numpy arrays (in general) a dataframe can contain heterogeneous data. 
2> Typically tabular data is represented using dataframes, which is analogous to an Excel sheet or a SQL table. This is extremely useful in representing raw datasets as well as processed feature sets in Machine Learning and Data Science. 
3> All the operations can be performed along the axes, rows, and columns, in a dataframe.

In [1]:
import pandas
pandas.__version__

'1.4.4'

In [2]:
import pandas as pd

In [3]:
# Example of series data type 

population_dict = {'California': 38332521,
'Texas': 26448193,
'New York': 19651127,
'Florida': 19552860,
'Illinois': 12882135}

population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [4]:
# By default, a Series will be created 
# where the index is drawn from the sorted values.

# Unlike a dictionary, though, 
# the Series also supports array-style operations such as slicing:

population['California':'Florida']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
dtype: int64

Constructing Dataframes
-----------------------
The next fundamental structure in Pandas is the DataFrame. 
Like the Series object, the DataFrame can be thought of either as a generalization of a NumPy array, or as a specialization of a Python dictionary.

A Pandas DataFrame can be constructed in a variety of ways. 
Here we’ll give several examples.

> From a single Series object. 
A DataFrame is a collection of Series objects, and a single column
DataFrame can be constructed from a single Series:

In [5]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [8]:
# Even if some keys in the dictionary are missing, 
# Pandas will fill them in with NaN (i.e., “not a number”) values:

pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

Data Retrieval
--------------
Pandas provides numerous ways to retrieve and read in data. We can convert data from CSV files, databases, flat files, and so on into dataframes. We can also convert a list of dictionaries (Python dict) into a dataframe.

We will cover three of the most important data sources:
• List of dictionaries
• CSV files
• Databases

In [10]:
# List of Dictionaries to Dataframe

import pandas as pd
d =  [{'city':'Delhi',"data":1000},
      {'city':'Banglaore',"data":2000},
      {'city':'Mumbai',"data":1000}]
pd.DataFrame(d)  

# Two important things to note here: 
# first,  the keys of dictionary are picked up as the column names 
# in the dataframe 
# secondly, it picks up the default index of normal arrays.

        city  data
0      Delhi  1000
1  Banglaore  2000
2     Mumbai  1000

In [11]:
import pandas as pd

In [12]:
# CSV Files to Dataframe  -> read student_records.csv file

data = pd.read_csv('RegularSeasonCompactResults.csv')
data.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [13]:
data.tail()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [14]:
data.describe()

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Numot
count,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000
mean,2001.574834,75.223816,1286.720646,76.600321,1282.864064,64.497009,0.044387
std,9.233342,33.287418,104.570275,12.173033,104.829234,11.380625,0.247819
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1994.000000,47.000000,1198.000000,68.000000,1191.000000,57.000000,0.000000
50%,2002.000000,78.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2010.000000,103.000000,1379.000000,84.000000,1375.000000,72.000000,0.000000
max,2016.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,6.000000

In [15]:
data.shape

(145289, 8)

In [16]:
data.index

RangeIndex(start=0, stop=145289, step=1)

In [17]:
#The info() function is used to print a concise summary of a DataFrame.
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145289 entries, 0 to 145288
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Season  145289 non-null  int64
 1   Daynum  145289 non-null  int64
 2   Wteam   145289 non-null  int64
 3   Wscore  145289 non-null  int64
 4   Lteam   145289 non-null  int64
 5   Lscore  145289 non-null  int64
 6   Wloc    145289 non-null  object
 7   Numot   145289 non-null  int64
dtypes: int64(7), object(1)
memory usage: 8.9+ MB

In [18]:
data.columns.tolist()

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [19]:
data.max()

Season    2016
Daynum     132
Wteam     1464
Wscore     186
Lteam     1464
Lscore     150
Wloc         N
Numot        6
dtype: object

In [20]:
data['Wscore'].max()

186

In [21]:
data['Lscore'].mean()

64.49700940883343

In [22]:
#argmax() function returns the indices of the maximum value present in the input Index. If we are having more than one maximum value (i.e. maximum value is present more than once) then it returns the index of the first occurrence of the maximum value
data['Wscore'].argmax()

24970

In [23]:
data['Season'].value_counts()

2016    5369
2014    5362
2015    5354
2013    5320
2010    5263
2012    5253
2009    5249
2011    5246
2008    5163
2007    5043
2006    4757
2005    4675
2003    4616
2004    4571
2002    4555
2000    4519
2001    4467
1999    4222
1998    4167
1997    4155
1992    4127
1991    4123
1996    4122
1995    4077
1994    4060
1990    4045
1989    4037
1993    3982
1988    3955
1987    3915
1986    3783
1985    3737
Name: Season, dtype: int64

# Accessing Values
Then, in order to get attributes about the game, we need to use the **iloc[]** function. Iloc is definitely one of the more important functions. The main idea is that you want to use it whenever you have the integer index of a certain row that you want to access. As per Pandas documentation, iloc is an "integer-location based indexing for selection by position."

In [24]:
data.iloc[[data['Wscore'].argmax()]]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
24970    1991      68   1258     186   1109     140    H      0

Let's take this a step further. Let's say you want to know the game with the highest scoring winning team (this is what we just calculated), but you then want to know how many points the losing team scored.

In [25]:
data.iloc[[data['Wscore'].argmax()]]['Lscore']

24970    140
Name: Lscore, dtype: int64

In [26]:
type(data.iloc[[data['Wscore'].argmax()]]['Lscore'])

pandas.core.series.Series

In [27]:
type(data.iloc[[data['Wscore'].argmax()]])

pandas.core.frame.DataFrame

The other really important function in Pandas is the **loc** function. Contrary to iloc, which is an integer based indexing, loc is a "Purely label-location based indexer for selection by label". Since all the games are ordered from 0 to 145288, iloc and loc are going to be pretty interchangable in this type of dataset

# Sorting [min to max]

In [32]:
data.sort_values('Lscore').head()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
100027    2008      66   1203      49   1387      20    H      0
49310     1997      66   1157      61   1204      21    H      0
89021     2006      44   1284      41   1343      21    A      0
85042     2005      66   1131      73   1216      22    H      0
103660    2009      26   1326      59   1359      22    H      0

In [ ]:
data.sort_values('Lscore').tail()

# Filtering Rows Conditionally

Now, let's say we want to find all of the rows that satisy a particular condition. For example, I want to find all of the games where the winning team scored more than 150 points. The idea behind this command is you want to access the column 'Wscore' of the dataframe df (df['Wscore']), find which entries are above 150 (df['Wscore'] > 150), and then returns only those specific rows in a dataframe format (df[df['Wscore'] > 150]).

In [33]:
data[data['Wscore'] > 150]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
5269     1986      75   1258     151   1109     107    H      0
12046    1988      40   1328     152   1147      84    H      0
12355    1988      52   1328     151   1173      99    N      0
16040    1989      40   1328     152   1331     122    H      0
16853    1989      68   1258     162   1109     144    A      0
17867    1989      92   1258     181   1109     150    H      0
19653    1990      30   1328     173   1109     101    H      0
19971    1990      38   1258     152   1109     137    A      0
20022    1990      40   1116     166   1109     101    H      0
22145    1990      97   1258     157   1362     115    H      0
23582    1991      26   1318     152   1258     123    N      0
24341    1991      47   1328     172   1258     112    H      0
24970    1991      68   1258     186   1109     140    H      0
25656    1991      84   1106     151   1212      97    H      0
28687    1992      54   1261     159   1319      86    H      0
35023    1993     112   1380     155   1341      91    A      0
40060    1995      32   1375     156   1341     114    H      0
52600    1998      33   1395     153   1410      87    H      0

This also works if you have multiple conditions. Let's say we want to find out when the winning team scores more than 150 points and when the losing team scores below 100.

In [34]:
data[(data['Wscore'] > 150) & (data['Lscore'] < 100)]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
12046    1988      40   1328     152   1147      84    H      0
12355    1988      52   1328     151   1173      99    N      0
25656    1991      84   1106     151   1212      97    H      0
28687    1992      54   1261     159   1319      86    H      0
35023    1993     112   1380     155   1341      91    A      0
52600    1998      33   1395     153   1410      87    H      0

# Grouping

Another important function in Pandas is **groupby()**. This is a function that allows you to group entries by certain attributes (e.g Grouping entries by Wteam number) and then perform operations on them. The following function groups all the entries (games) with the same Wteam number and finds the mean for each group.

In [35]:
data.groupby('Wteam')['Wscore'].mean().head(50)

Wteam
1101    78.111111
1102    69.893204
1103    75.839768
1104    75.825944
1105    74.960894
1106    76.634518
1107    70.804781
1108    79.489865
1109    90.428571
1110    72.141844
1111    77.829684
1112    82.219839
1113    77.926931
1114    76.019960
1115    68.496599
1116    84.521600
1117    74.592255
1118    66.500000
1119    72.388693
1120    78.158562
1121    75.041667
1122    77.977117
1123    74.561845
1124    78.679039
1125    80.121495
1126    72.485149
1127    69.063694
1128    72.044776
1129    74.706897
1130    77.772358
1131    72.609943
1132    73.754587
1133    74.429175
1134    77.520000
1135    74.854037
1136    74.435897
1137    74.000000
1138    75.387879
1139    72.661512
1140    80.070175
1141    75.099688
1142    75.401747
1143    77.177419
1144    74.977199
1145    74.917258
1146    78.387097
1147    82.012766
1148    75.793003
1149    76.343750
1150    78.000000
Name: Wscore, dtype: float64

This next command groups all the games with the same Wteam number and finds where how many times that specific team won at home, on the road, or at a neutral site

In [36]:
# Adding a column

data.insert(2,"New","Default value")

data.head()

   Season  Daynum            New  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20  Default value   1228      81   1328      64    N      0
1    1985      25  Default value   1106      77   1354      70    H      0
2    1985      25  Default value   1112      63   1223      56    H      0
3    1985      25  Default value   1165      70   1432      54    H      0
4    1985      25  Default value   1192      86   1447      74    H      0

In [37]:
# Deleting a column

# the drop method can also be used

data.drop(['New'],axis=1)

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0         1985      20   1228      81   1328      64    N      0
1         1985      25   1106      77   1354      70    H      0
2         1985      25   1112      63   1223      56    H      0
3         1985      25   1165      70   1432      54    H      0
4         1985      25   1192      86   1447      74    H      0
...        ...     ...    ...     ...    ...     ...  ...    ...
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

[145289 rows x 8 columns]

In [38]:
data.values

array([[1985, 20, 'Default value', ..., 64, 'N', 0],
       [1985, 25, 'Default value', ..., 70, 'H', 0],
       [1985, 25, 'Default value', ..., 56, 'H', 0],
       ...,
       [2016, 132, 'Default value', ..., 77, 'N', 1],
       [2016, 132, 'Default value', ..., 62, 'N', 0],
       [2016, 132, 'Default value', ..., 74, 'N', 0]], dtype=object)

In [39]:
data.values[0][0]

1985

# Extracting Rows and Columns
#col by name
#rows by index number

In [40]:
data[['Wscore', 'Lscore']].head()

   Wscore  Lscore
0      81      64
1      77      70
2      63      56
3      70      54
4      86      74

You've seen before that you can access columns through df['col name']. You can access rows by using slicing operations.

In [41]:
data[0:3]

   Season  Daynum            New  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20  Default value   1228      81   1328      64    N      0
1    1985      25  Default value   1106      77   1354      70    H      0
2    1985      25  Default value   1112      63   1223      56    H      0

# Data Cleaning

In [42]:
data.isnull().sum()

Season    0
Daynum    0
New       0
Wteam     0
Wscore    0
Lteam     0
Lscore    0
Wloc      0
Numot     0
dtype: int64

If you do end up having missing values in your datasets, be sure to get familiar with these two functions. 
* **dropna()** - This function allows you to drop all(or some) of the rows that have missing values. 
* **fillna()** - This function allows you replace the rows that have missing values with the value that you pass in.

In [46]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})
df
#(N)ot-(A)-(T)ime, the time equivalent of NaN

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [47]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

# Lab Exercise

# IPL Datasets

In [42]:
#Read the CSV file: 'matches.csv'
import pandas as pd
#sarthak_csv
data = pd.read_csv('matches.csv')
data.head()

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,2017-04-05,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,2017-04-06,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,2017,Rajkot,2017-04-07,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN
3,4,2017,Indore,2017-04-08,Rising Pune Supergiant,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN
4,5,2017,Bangalore,2017-04-08,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN

In [41]:
#Find out the first five rows of IPL dataset.
import pandas as pd
#csv
data = pd.read_csv("matches.csv")
data.head()

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,2017-04-05,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,2017-04-06,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,2017,Rajkot,2017-04-07,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN
3,4,2017,Indore,2017-04-08,Rising Pune Supergiant,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN
4,5,2017,Bangalore,2017-04-08,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN

In [40]:
#Find out the Last five rows of IPL dataset.
import pandas as pd
#IPl
data = pd.read_csv("matches.csv")
data.tail()

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
631,632,2016,Raipur,2016-05-22,Delhi Daredevils,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Royal Challengers Bangalore,0,6,V Kohli,Shaheed Veer Narayan Singh International Stadium,A Nand Kishore,BNJ Oxenford,NaN
632,633,2016,Bangalore,2016-05-24,Gujarat Lions,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Royal Challengers Bangalore,0,4,AB de Villiers,M Chinnaswamy Stadium,AK Chaudhary,HDPK Dharmasena,NaN
633,634,2016,Delhi,2016-05-25,Sunrisers Hyderabad,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Sunrisers Hyderabad,22,0,MC Henriques,Feroz Shah Kotla,M Erasmus,C Shamshuddin,NaN
634,635,2016,Delhi,2016-05-27,Gujarat Lions,Sunrisers Hyderabad,Sunrisers Hyderabad,field,normal,0,Sunrisers Hyderabad,0,4,DA Warner,Feroz Shah Kotla,M Erasmus,CK Nandan,NaN
635,636,2016,Bangalore,2016-05-29,Sunrisers Hyderabad,Royal Challengers Bangalore,Sunrisers Hyderabad,bat,normal,0,Sunrisers Hyderabad,8,0,BCJ Cutting,M Chinnaswamy Stadium,HDPK Dharmasena,BNJ Oxenford,NaN

In [39]:
#Find out all the coloumns of IPL dataset.[hint:columns.to_list()]
import pandas as pd

data = pd.read_csv("matches.csv")
data.columns

Index(['id', 'season', 'city', 'date', 'team1', 'team2', 'toss_winner',
       'toss_decision', 'result', 'dl_applied', 'winner', 'win_by_runs',
       'win_by_wickets', 'player_of_match', 'venue', 'umpire1', 'umpire2',
       'umpire3'],
      dtype='object')

In [38]:
#Find out the shape of IPL dataset.[hint:,shape]
import pandas as pd
#CSV
data = pd.read_csv("matches.csv")
data.shape

(636, 18)

In [37]:
##Find out the Descriptive Statistics of IPL dataset.[hint:.describe()]
import pandas as pd

data = pd.read_csv("matches.csv")
data.describe()

,id,season,dl_applied,win_by_runs,win_by_wickets,umpire3
count,636.000000,636.000000,636.000000,636.000000,636.000000,0.0
mean,318.500000,2012.490566,0.025157,13.682390,3.372642,NaN
std,183.741666,2.773026,0.156726,23.908877,3.420338,NaN
min,1.000000,2008.000000,0.000000,0.000000,0.000000,NaN
25%,159.750000,2010.000000,0.000000,0.000000,0.000000,NaN
50%,318.500000,2012.000000,0.000000,0.000000,4.000000,NaN
75%,477.250000,2015.000000,0.000000,20.000000,7.000000,NaN
max,636.000000,2017.000000,1.000000,146.000000,10.000000,NaN

In [36]:
#Print a concise summary of IPL data Set.[hint:.info()]
import pandas as pd

data = pd.read_csv("matches.csv")
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 636 entries, 0 to 635
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               636 non-null    int64
 1   season           636 non-null    int64
 2   city             629 non-null    object
 3   date             636 non-null    object
 4   team1            636 non-null    object
 5   team2            636 non-null    object
 6   toss_winner      636 non-null    object
 7   toss_decision    636 non-null    object
 8   result           636 non-null    object
 9   dl_applied       636 non-null    int64
 10  winner           633 non-null    object
 11  win_by_runs      636 non-null    int64
 12  win_by_wickets   636 non-null    int64
 13  player_of_match  633 non-null    object
 14  venue            636 non-null    object
 15  umpire1          635 non-null    object
 16  umpire2          635 non-null    object
 17  umpire3          0 non-null      float64
dtypes: float64(1), int64(5), object(12)
memory usage: 89.6+ KB

In [34]:
#Print one column:the first 5 values
import pandas as pd

data = pd.read_csv("matches.csv")
print(data['season'].head())

0    2017
1    2017
2    2017
3    2017
4    2017
Name: season, dtype: int64

In [33]:
#Print two columns:the first 5 values
import pandas as pd

data = pd.read_csv("matches.csv")
print(data[['city','season']].head())

        city  season
0  Hyderabad    2017
1       Pune    2017
2     Rajkot    2017
3     Indore    2017
4  Bangalore    2017

In [32]:
#Find the max wining runs[hint:['win_by_runs'].max()]
import pandas as pd

data = pd.read_csv("matches.csv")
print(data['win_by_runs'].max())

146

In [31]:
#Find the mean of 'win_by_wickets'[hint:['win_by_wickets'].mean()]
import pandas as pd

data=pd.read_csv("matches.csv")
print(data['win_by_wickets'].mean())

3.3726415094339623

In [30]:
### How many matches we've got in the dataset?[hint:['id'].max()]
import pandas as pd

data=pd.read_csv("matches.csv")
print(data["id"].max())

636

In [1]:
### How many seasons we've got in the dataset? Hint:['season'].unique() and len
import pandas as pd

data=pd.read_csv("RegularSeasonCompactResults.csv")
print(data['Season'].unique())

[1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998
 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012
 2013 2014 2015 2016]

In [44]:
### Which Team had won by maximum runs?Hint:iloc[df['win_by_runs'].argmax()]
import pandas as pd

data = pd.read_csv("matches.csv")
data.iloc[data['win_by_runs'].argmax()]

id                               44
season                         2017
city                          Delhi
date                     2017-05-06
team1                Mumbai Indians
team2              Delhi Daredevils
toss_winner        Delhi Daredevils
toss_decision                 field
result                       normal
dl_applied                        0
winner               Mumbai Indians
win_by_runs                     146
win_by_wickets                    0
player_of_match         LMP Simmons
venue              Feroz Shah Kotla
umpire1                 Nitin Menon
umpire2                   CK Nandan
umpire3                         NaN
Name: 43, dtype: object

In [47]:
### Which Team had won by maximum wickets?Hint:iloc[df['win_by_wickets'].argmax()]
import pandas as pd

data = pd.read_csv("matches.csv")
data.iloc[data['win_by_wickets'].argmax()]

id                                                      3
season                                               2017
city                                               Rajkot
date                                           2017-04-07
team1                                       Gujarat Lions
team2                               Kolkata Knight Riders
toss_winner                         Kolkata Knight Riders
toss_decision                                       field
result                                             normal
dl_applied                                              0
winner                              Kolkata Knight Riders
win_by_runs                                             0
win_by_wickets                                         10
player_of_match                                   CA Lynn
venue              Saurashtra Cricket Association Stadium
umpire1                                       Nitin Menon
umpire2                                         CK Nandan
umpire3                                               NaN
Name: 2, dtype: object

In [49]:
#Add a new column in the data set
import pandas as pd
data = pd.read_csv('matches.csv')
data.insert(2,"New","Default")
print(data)
# since the data is it is too long, it does not match the size of index 145289

      id  season      New       city        date                        team1  \
0      1    2017  Default  Hyderabad  2017-04-05          Sunrisers Hyderabad
1      2    2017  Default       Pune  2017-04-06               Mumbai Indians
2      3    2017  Default     Rajkot  2017-04-07                Gujarat Lions
3      4    2017  Default     Indore  2017-04-08       Rising Pune Supergiant
4      5    2017  Default  Bangalore  2017-04-08  Royal Challengers Bangalore
..   ...     ...      ...        ...         ...                          ...
631  632    2016  Default     Raipur  2016-05-22             Delhi Daredevils
632  633    2016  Default  Bangalore  2016-05-24                Gujarat Lions
633  634    2016  Default      Delhi  2016-05-25          Sunrisers Hyderabad
634  635    2016  Default      Delhi  2016-05-27                Gujarat Lions
635  636    2016  Default  Bangalore  2016-05-29          Sunrisers Hyderabad

                           team2                  toss_winner toss_decision  \
0    Royal Challengers Bangalore  Royal Challengers Bangalore         field
1         Rising Pune Supergiant       Rising Pune Supergiant         field
2          Kolkata Knight Riders        Kolkata Knight Riders         field
3                Kings XI Punjab              Kings XI Punjab         field
4               Delhi Daredevils  Royal Challengers Bangalore           bat
..                           ...                          ...           ...
631  Royal Challengers Bangalore  Royal Challengers Bangalore         field
632  Royal Challengers Bangalore  Royal Challengers Bangalore         field
633        Kolkata Knight Riders        Kolkata Knight Riders         field
634          Sunrisers Hyderabad          Sunrisers Hyderabad         field
635  Royal Challengers Bangalore          Sunrisers Hyderabad           bat

     result  dl_applied                       winner  win_by_runs  \
0    normal           0          Sunrisers Hyderabad           35
1    normal           0       Rising Pune Supergiant            0
2    normal           0        Kolkata Knight Riders            0
3    normal           0              Kings XI Punjab            0
4    normal           0  Royal Challengers Bangalore           15
..      ...         ...                          ...          ...
631  normal           0  Royal Challengers Bangalore            0
632  normal           0  Royal Challengers Bangalore            0
633  normal           0          Sunrisers Hyderabad           22
634  normal           0          Sunrisers Hyderabad            0
635  normal           0          Sunrisers Hyderabad            8

     win_by_wickets player_of_match  \
0                 0    Yuvraj Singh
1                 7       SPD Smith
2                10         CA Lynn
3                 6      GJ Maxwell
4                 0       KM Jadhav
..              ...             ...
631               6         V Kohli
632               4  AB de Villiers
633               0    MC Henriques
634               4       DA Warner
635               0     BCJ Cutting

                                                venue          umpire1  \
0           Rajiv Gandhi International Stadium, Uppal      AY Dandekar
1             Maharashtra Cricket Association Stadium   A Nand Kishore
2              Saurashtra Cricket Association Stadium      Nitin Menon
3                              Holkar Cricket Stadium     AK Chaudhary
4                               M Chinnaswamy Stadium              NaN
..                                                ...              ...
631  Shaheed Veer Narayan Singh International Stadium   A Nand Kishore
632                             M Chinnaswamy Stadium     AK Chaudhary
633                                  Feroz Shah Kotla        M Erasmus
634                                  Feroz Shah Kotla        M Erasmus
635                             M Chinnaswamy Stadium  HDPK Dharmasena

             umpire2  umpire3
0           NJ Llong      NaN
1             S Ravi      NaN
2          CK Nandan      NaN
3      C Shamshuddin      NaN
4                NaN      NaN
..               ...      ...
631     BNJ Oxenford      NaN
632  HDPK Dharmasena      NaN
633    C Shamshuddin      NaN
634        CK Nandan      NaN
635     BNJ Oxenford      NaN

[636 rows x 19 columns]

In [56]:
#Delete a column in the data set
import pandas as pd
data = pd.read_csv('matches.csv')
data=data.drop('Season', axis=1)
data

KeyError: "['Season'] not found in axis"

# HR Employee Attrition and Performance Data Set

In [10]:
#Read the CSV file: 'HR_Employee_Attrition.csv'
import pandas as pd
data=pd.read_csv('HR.csv')

In [9]:
##Find out the first and last five rows
import pandas as pd
data=pd.read_csv('HR.csv')
print(data.head())
print(data.tail())

   Age Attrition     BusinessTravel  DailyRate              Department  \
0   41       Yes      Travel_Rarely       1102                   Sales
1   49        No  Travel_Frequently        279  Research & Development
2   37       Yes      Travel_Rarely       1373  Research & Development
3   33        No  Travel_Frequently       1392  Research & Development
4   27        No      Travel_Rarely        591  Research & Development

   DistanceFromHome  Education EducationField  EmployeeCount  EmployeeNumber  \
0                 1          2  Life Sciences              1               1
1                 8          1  Life Sciences              1               2
2                 2          2          Other              1               4
3                 3          4  Life Sciences              1               5
4                 2          1        Medical              1               7

   ...  RelationshipSatisfaction StandardHours  StockOptionLevel  \
0  ...                         1            80                 0
1  ...                         4            80                 1
2  ...                         2            80                 0
3  ...                         3            80                 0
4  ...                         4            80                 1

   TotalWorkingYears  TrainingTimesLastYear WorkLifeBalance  YearsAtCompany  \
0                  8                      0               1               6
1                 10                      3               3              10
2                  7                      3               3               0
3                  8                      3               3               8
4                  6                      3               3               2

  YearsInCurrentRole  YearsSinceLastPromotion  YearsWithCurrManager
0                  4                        0                     5
1                  7                        1                     7
2                  0                        0                     0
3                  7                        3                     0
4                  2                        2                     2

[5 rows x 35 columns]
      Age Attrition     BusinessTravel  DailyRate              Department  \
1465   36        No  Travel_Frequently        884  Research & Development
1466   39        No      Travel_Rarely        613  Research & Development
1467   27        No      Travel_Rarely        155  Research & Development
1468   49        No  Travel_Frequently       1023                   Sales
1469   34        No      Travel_Rarely        628  Research & Development

      DistanceFromHome  Education EducationField  EmployeeCount  \
1465                23          2        Medical              1
1466                 6          1        Medical              1
1467                 4          3  Life Sciences              1
1468                 2          3        Medical              1
1469                 8          3        Medical              1

      EmployeeNumber  ...  RelationshipSatisfaction StandardHours  \
1465            2061  ...                         3            80
1466            2062  ...                         1            80
1467            2064  ...                         2            80
1468            2065  ...                         4            80
1469            2068  ...                         1            80

      StockOptionLevel  TotalWorkingYears  TrainingTimesLastYear  \
1465                 1                 17                      3
1466                 1                  9                      5
1467                 1                  6                      0
1468                 0                 17                      3
1469                 0                  6                      3

     WorkLifeBalance  YearsAtCompany YearsInCurrentRole  \
1465               3               5                  2
1466               3               7                  7
1467               3               6                  2
1468               2               9                  6
1469               4               4                  3

      YearsSinceLastPromotion  YearsWithCurrManager
1465                        0                     3
1466                        1                     7
1467                        0                     3
1468                        0                     8
1469                        1                     2

[5 rows x 35 columns]

In [8]:
#Find out all the columns of  dataset.
import pandas as pd
data=pd.read_csv('HR.csv')
data.columns.to_list()

['Age',
 'Attrition',
 'BusinessTravel',
 'DailyRate',
 'Department',
 'DistanceFromHome',
 'Education',
 'EducationField',
 'EmployeeCount',
 'EmployeeNumber',
 'EnvironmentSatisfaction',
 'Gender',
 'HourlyRate',
 'JobInvolvement',
 'JobLevel',
 'JobRole',
 'JobSatisfaction',
 'MaritalStatus',
 'MonthlyIncome',
 'MonthlyRate',
 'NumCompaniesWorked',
 'Over18',
 'OverTime',
 'PercentSalaryHike',
 'PerformanceRating',
 'RelationshipSatisfaction',
 'StandardHours',
 'StockOptionLevel',
 'TotalWorkingYears',
 'TrainingTimesLastYear',
 'WorkLifeBalance',
 'YearsAtCompany',
 'YearsInCurrentRole',
 'YearsSinceLastPromotion',
 'YearsWithCurrManager']

In [7]:
#Find out all the shape of  dataset.
import pandas as pd
data=pd.read_csv('HR.csv')
data.shape

(1470, 35)

In [6]:
#Print one column:the first 5 values
import pandas as pd
data=pd.read_csv('HR.csv')
print(data["Age"].head())

0    41
1    49
2    37
3    33
4    27
Name: Age, dtype: int64

In [5]:
#Print three columns: the last 5 values.
import pandas as pd
data=pd.read_csv('HR.csv')
print(data[["Age","Education","Attrition"]].tail())

      Age  Education Attrition
1465   36          2        No
1466   39          1        No
1467   27          3        No
1468   49          3        No
1469   34          3        No

In [4]:
### How many employees are there by department in the dataset?
import pandas as pd
data=pd.read_csv('HR.csv')
print(data["EmployeeCount"].count())

1470

In [11]:
### What is the overall attrition rate?
import pandas as pd
data=pd.read_csv('HR.csv')
print(data["Attrition"].count())

1470

In [12]:
### What is the average hourly rate?
import pandas as pd
data=pd.read_csv('HR.csv')
print(data["DailyRate"].mean())

802.4857142857143

In [13]:
### What is the average number of years at the company?
import pandas as pd
data=pd.read_csv('HR.csv')
print(data["YearsAtCompany"].mean())

7.0081632653061225

In [15]:
### Who are the 5 employees with the most number of years at the company?Hint:.sort_values(ascending=False)[:5]
import pandas as pd
data=pd.read_csv('HR.csv')
print(data.sort_values('YearsAtCompany',ascending=False).head())

      Age Attrition BusinessTravel  DailyRate              Department  \
126    58       Yes  Travel_Rarely        147  Research & Development
98     58        No  Travel_Rarely        682                   Sales
1116   55        No  Travel_Rarely        685                   Sales
270    55        No  Travel_Rarely        452  Research & Development
561    52        No  Travel_Rarely        621                   Sales

      DistanceFromHome  Education EducationField  EmployeeCount  \
126                 23          4        Medical              1
98                  10          4        Medical              1
1116                26          5      Marketing              1
270                  1          3        Medical              1
561                  3          4      Marketing              1

      EmployeeNumber  ...  RelationshipSatisfaction StandardHours  \
126              165  ...                         4            80
98               131  ...                         3            80
1116            1578  ...                         3            80
270              374  ...                         3            80
561              776  ...                         1            80

      StockOptionLevel  TotalWorkingYears  TrainingTimesLastYear  \
126                  1                 40                      3
98                   0                 38                      1
1116                 1                 36                      3
270                  0                 37                      2
561                  0                 34                      3

     WorkLifeBalance  YearsAtCompany YearsInCurrentRole  \
126                2              40                 10
98                 2              37                 10
1116               3              36                  6
270                3              36                 10
561                4              34                  6

      YearsSinceLastPromotion  YearsWithCurrManager
126                        15                     6
98                          1                     8
1116                        2                    13
270                         4                    13
561                         1                    16

[5 rows x 35 columns]

In [16]:

### How satisfied are employees overall?
import pandas as pd
data=pd.read_csv('HR.csv')
print(data["RelationshipSatisfaction"].mean)

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0       1
1       4
2       2
3       3
4       4
       ..
1465    3
1466    1
1467    2
1468    4
1469    1
Name: RelationshipSatisfaction, Length: 1470, dtype: int64>

In [17]:
##Find out the Descriptive Statistics of dataset.
import pandas as pd
data = pd.read_csv('HR.csv')
print(data.describe())

               Age    DailyRate  DistanceFromHome    Education  EmployeeCount  \
count  1470.000000  1470.000000       1470.000000  1470.000000         1470.0
mean     36.923810   802.485714          9.192517     2.912925            1.0
std       9.135373   403.509100          8.106864     1.024165            0.0
min      18.000000   102.000000          1.000000     1.000000            1.0
25%      30.000000   465.000000          2.000000     2.000000            1.0
50%      36.000000   802.000000          7.000000     3.000000            1.0
75%      43.000000  1157.000000         14.000000     4.000000            1.0
max      60.000000  1499.000000         29.000000     5.000000            1.0

       EmployeeNumber  EnvironmentSatisfaction   HourlyRate  JobInvolvement  \
count     1470.000000              1470.000000  1470.000000     1470.000000
mean      1024.865306                 2.721769    65.891156        2.729932
std        602.024335                 1.093082    20.329428        0.711561
min          1.000000                 1.000000    30.000000        1.000000
25%        491.250000                 2.000000    48.000000        2.000000
50%       1020.500000                 3.000000    66.000000        3.000000
75%       1555.750000                 4.000000    83.750000        3.000000
max       2068.000000                 4.000000   100.000000        4.000000

          JobLevel  ...  RelationshipSatisfaction  StandardHours  \
count  1470.000000  ...               1470.000000         1470.0
mean      2.063946  ...                  2.712245           80.0
std       1.106940  ...                  1.081209            0.0
min       1.000000  ...                  1.000000           80.0
25%       1.000000  ...                  2.000000           80.0
50%       2.000000  ...                  3.000000           80.0
75%       3.000000  ...                  4.000000           80.0
max       5.000000  ...                  4.000000           80.0

       StockOptionLevel  TotalWorkingYears  TrainingTimesLastYear  \
count       1470.000000        1470.000000            1470.000000
mean           0.793878          11.279592               2.799320
std            0.852077           7.780782               1.289271
min            0.000000           0.000000               0.000000
25%            0.000000           6.000000               2.000000
50%            1.000000          10.000000               3.000000
75%            1.000000          15.000000               3.000000
max            3.000000          40.000000               6.000000

       WorkLifeBalance  YearsAtCompany  YearsInCurrentRole  \
count      1470.000000     1470.000000         1470.000000
mean          2.761224        7.008163            4.229252
std           0.706476        6.126525            3.623137
min           1.000000        0.000000            0.000000
25%           2.000000        3.000000            2.000000
50%           3.000000        5.000000            3.000000
75%           3.000000        9.000000            7.000000
max           4.000000       40.000000           18.000000

       YearsSinceLastPromotion  YearsWithCurrManager
count              1470.000000           1470.000000
mean                  2.187755              4.123129
std                   3.222430              3.568136
min                   0.000000              0.000000
25%                   0.000000              2.000000
50%                   1.000000              3.000000
75%                   3.000000              7.000000
max                  15.000000             17.000000

[8 rows x 26 columns]

In [18]:
#Print a concise summary of data Set.
import pandas as pd
data = pd.read_csv('HR.csv')
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB
None

In [21]:

#Add a new column in the data set
import pandas as pd
data = pd.read_csv('HR.csv')
data.insert(2,"New","Default")
print(data)

      Age Attrition      New     BusinessTravel  DailyRate  \
0      41       Yes  Default      Travel_Rarely       1102
1      49        No  Default  Travel_Frequently        279
2      37       Yes  Default      Travel_Rarely       1373
3      33        No  Default  Travel_Frequently       1392
4      27        No  Default      Travel_Rarely        591
...   ...       ...      ...                ...        ...
1465   36        No  Default  Travel_Frequently        884
1466   39        No  Default      Travel_Rarely        613
1467   27        No  Default      Travel_Rarely        155
1468   49        No  Default  Travel_Frequently       1023
1469   34        No  Default      Travel_Rarely        628

                  Department  DistanceFromHome  Education EducationField  \
0                      Sales                 1          2  Life Sciences
1     Research & Development                 8          1  Life Sciences
2     Research & Development                 2          2          Other
3     Research & Development                 3          4  Life Sciences
4     Research & Development                 2          1        Medical
...                      ...               ...        ...            ...
1465  Research & Development                23          2        Medical
1466  Research & Development                 6          1        Medical
1467  Research & Development                 4          3  Life Sciences
1468                   Sales                 2          3        Medical
1469  Research & Development                 8          3        Medical

      EmployeeCount  ...  RelationshipSatisfaction  StandardHours  \
0                 1  ...                         1             80
1                 1  ...                         4             80
2                 1  ...                         2             80
3                 1  ...                         3             80
4                 1  ...                         4             80
...             ...  ...                       ...            ...
1465              1  ...                         3             80
1466              1  ...                         1             80
1467              1  ...                         2             80
1468              1  ...                         4             80
1469              1  ...                         1             80

     StockOptionLevel  TotalWorkingYears  TrainingTimesLastYear  \
0                   0                  8                      0
1                   1                 10                      3
2                   0                  7                      3
3                   0                  8                      3
4                   1                  6                      3
...               ...                ...                    ...
1465                1                 17                      3
1466                1                  9                      5
1467                1                  6                      0
1468                0                 17                      3
1469                0                  6                      3

      WorkLifeBalance YearsAtCompany  YearsInCurrentRole  \
0                   1              6                   4
1                   3             10                   7
2                   3              0                   0
3                   3              8                   7
4                   3              2                   2
...               ...            ...                 ...
1465                3              5                   2
1466                3              7                   7
1467                3              6                   2
1468                2              9                   6
1469                4              4                   3

     YearsSinceLastPromotion  YearsWithCurrManager
0                          0                     5
1                          1                     7
2                          0                     0
3                          3                     0
4                          2                     2
...                      ...                   ...
1465                       0                     3
1466                       1                     7
1467                       0                     3
1468                       0                     8
1469                       1                     2

[1470 rows x 36 columns]

In [22]:
#Delete a column in the data set.
import pandas as pd
data = pd.read_csv('HR.csv')
data.drop('JobLevel', axis=1)
print(data)

      Age Attrition     BusinessTravel  DailyRate              Department  \
0      41       Yes      Travel_Rarely       1102                   Sales
1      49        No  Travel_Frequently        279  Research & Development
2      37       Yes      Travel_Rarely       1373  Research & Development
3      33        No  Travel_Frequently       1392  Research & Development
4      27        No      Travel_Rarely        591  Research & Development
...   ...       ...                ...        ...                     ...
1465   36        No  Travel_Frequently        884  Research & Development
1466   39        No      Travel_Rarely        613  Research & Development
1467   27        No      Travel_Rarely        155  Research & Development
1468   49        No  Travel_Frequently       1023                   Sales
1469   34        No      Travel_Rarely        628  Research & Development

      DistanceFromHome  Education EducationField  EmployeeCount  \
0                    1          2  Life Sciences              1
1                    8          1  Life Sciences              1
2                    2          2          Other              1
3                    3          4  Life Sciences              1
4                    2          1        Medical              1
...                ...        ...            ...            ...
1465                23          2        Medical              1
1466                 6          1        Medical              1
1467                 4          3  Life Sciences              1
1468                 2          3        Medical              1
1469                 8          3        Medical              1

      EmployeeNumber  ...  RelationshipSatisfaction StandardHours  \
0                  1  ...                         1            80
1                  2  ...                         4            80
2                  4  ...                         2            80
3                  5  ...                         3            80
4                  7  ...                         4            80
...              ...  ...                       ...           ...
1465            2061  ...                         3            80
1466            2062  ...                         1            80
1467            2064  ...                         2            80
1468            2065  ...                         4            80
1469            2068  ...                         1            80

      StockOptionLevel  TotalWorkingYears  TrainingTimesLastYear  \
0                    0                  8                      0
1                    1                 10                      3
2                    0                  7                      3
3                    0                  8                      3
4                    1                  6                      3
...                ...                ...                    ...
1465                 1                 17                      3
1466                 1                  9                      5
1467                 1                  6                      0
1468                 0                 17                      3
1469                 0                  6                      3

     WorkLifeBalance  YearsAtCompany YearsInCurrentRole  \
0                  1               6                  4
1                  3              10                  7
2                  3               0                  0
3                  3               8                  7
4                  3               2                  2
...              ...             ...                ...
1465               3               5                  2
1466               3               7                  7
1467               3               6                  2
1468               2               9                  6
1469               4               4                  3

      YearsSinceLastPromotion  YearsWithCurrManager
0                           0                     5
1                           1                     7
2                           0                     0
3                           3                     0
4                           2                     2
...                       ...                   ...
1465                        0                     3
1466                        1                     7
1467                        0                     3
1468                        0                     8
1469                        1                     2

[1470 rows x 35 columns]